org-files/ubuntu-headless-server-custom-resolution.org
#+TITLE: 调整没有显示器的ubuntu server的分辨率

以下命令仅仅在Ubuntu 16.04 x86_64上测试通过。

参考：http://ubuntuhandbook.org/index.php/2017/04/custom-screen-resolution-ubuntu-desktop/

* 获取显示器的名字

  #+BEGIN_SRC shell
  xrandr
  #+END_SRC

  输出

  #+BEGIN_SRC 
  Screen 0: minimum 320 x 200, current 1024 x 768, maximum 1920 x 2048
  VGA-1 connected primary 1024x768+0+0 (normal left inverted right x axis y axis) 0mm x 0mm
   1024x768      60.00* 
   800x600       60.32    56.25  
   640x480       59.94  
  #+END_SRC
  
  上面的 "VGA-1" 就是显示器名字

* 计算特定分辨率之下的 VESA CVT 模式行
  #+BEGIN_SRC shell
  cvt 1920 1080
  #+END_SRC

  #+BEGIN_SRC shell
  # 1920x1080 59.96 Hz (CVT 2.07M9) hsync: 67.16 kHz; pclk: 173.00 MHz
  Modeline "1920x1080_60.00"  173.00  1920 2048 2248 2576  1080 1083 1088 1120 -hsync +vsync  
  #+END_SRC

  输出里Modeline后面的配置行很重要：
  #+BEGIN_SRC shell
  "1920x1080_60.00"  173.00  1920 2048 2248 2576  1080 1083 1088 1120 -hsync +vsync  
  #+END_SRC

* 当前gnome session里做测试

** 定义新模式

   需要sudo。

  #+BEGIN_SRC shell
  sudo xrandr --newmode "1920x1080_60.00"  173.00  1920 2048 2248 2576  1080 1083 1088 1120 -hsync +vsync
  #+END_SRC

** 添加上一步定义的新模式

   #+BEGIN_SRC shell
   sudo xrandr --addmode VGA-1 "1920x1080_60.00"
   #+END_SRC

** 启用新模式
   
   去gnome的设置里，选择刚才添加的模式。

* 固化设置

  把之前用到的两行涉及xrandr的配置加入~/.xinitrc 或者 ~/.profile

  #+BEGIN_SRC 
  xrandr --newmode "1920x1080_60.00"  173.00  1920 2048 2248 2576  1080 1083 1088 1120 -hsync +vsync
  xrandr --addmode VGA-1 "1920x1080_60.00"
  #+END_SRC

  然后就ok了。